Repository: kartchnb/AutoTowersGenerator
Catalog: Resources/i18n/*/autotowers.po
Languages: fr_fr

# @menu
source: Auto Towers
fr_fr: Tours Auto

# @menu
source: Settings
fr_fr: Réglages

# @msg
source: The following settings were restored :
fr_fr: Les paramètres suivants ont été rétablis :

# @msg
source: The following settings were changed :
fr_fr: Les paramètres suivants ont été modifiés :

# @msg
source: The following setting changes are recommended :
fr_fr: Il est recommandé de modifier les paramètres suivants :

# @msg
source: The Auto Tower was removed because the active machine was changed
fr_fr: L'Auto Tower a été supprimée parce que la machine active a été modifiée

# @msg
source: The Auto Tower was removed because the active extruder changed
fr_fr: L'Auto Tower a été supprimée parce que l'extrudeur actif a changé

# @msg
source: Removing the autotower because Cura is closing
fr_fr: Suppression de l'autotower en raison de la fermeture de Cura

# @test
source: Retraction Tower
fr_fr: Tour de rétraction

# @test
source: Fan Tower
fr_fr: Tour de ventilateur

# @test
source: Speed Tower
fr_fr: Tour de vitesse

# @test
source: Bed Level Pattern
fr_fr: Mise à niveau plateau

# @test
source: Flow Tower
fr_fr: Tour de débit

# @test
source: Temp Tower
fr_fr: Tour de température

# @model
source: Flow Tower - Flow 115-85
fr_fr: Tour de débit - Débit 115-85

# @model
source: Flow Tower (Spiral) - Flow 115-85
fr_fr: Tour de débit (spirale) - Débit 115-85

# @type
source: Spiral
fr_fr: Spirale

# @model
source: Speed Tower - Print Speed 20-100
fr_fr: Tour de vitesse - Vitesse d'impression 20-100

# @model
source: Speed Tower - Print Speed 50-150
fr_fr: Tour de vitesse - Vitesse d'impression 50-150

# @model
source: Speed Tower - Print Speed 100-200
fr_fr: Tour de vitesse - Vitesse d'impression 100-200

# @type
source: Print Speed
fr_fr: Vitesse d’impression

# @type
source: Acceleration
fr_fr: Accélération

# @type
source: Jerk
fr_fr: Saccade

# @type
source: Junction
fr_fr: Jonction

# @type
source: RepRap Pressure
fr_fr: Pression RepRap

# @model
source: Temperature Tower - ABA
fr_fr: Tour de température - ABA

# @model
source: Temperature Tower - ABS
fr_fr: Tour de température - ABS

# @model
source: Temperature Tower - Nylon
fr_fr: Tour de température - Nylon

# @model
source: Temperature Tower - PC
fr_fr: Tour de température - PC

# @model
source: Temperature Tower - PETG
fr_fr: Tour de température - PETG

# @model
source: Temperature Tower - PLA
fr_fr: Tour de température - PLA

# @model
source: Temperature Tower - PLA+
fr_fr: Tour de température - PLA+

# @model
source: Temperature Tower - TPU
fr_fr: Tour de température - TPU

# @model
source: Retract Tower - Retract Distance 0.4-1.2
fr_fr: Tour de rétraction - Distance de rétraction 0.4-1.2

# @model
source: Retract Tower - Retract Distance 1.2-2.0
fr_fr: Tour de rétraction - Distance de rétraction 1.2-2

# @model
source: Retract Tower - Retract Distance 1-6
fr_fr: Tour de rétraction - Distance de rétraction 1-6

# @model
source: Retract Tower - Retract Distance 4-9
fr_fr: Tour de rétraction - Distance de rétraction 4-9

# @model
source: Retract Tower - Retract Distance 7-12
fr_fr: Tour de rétraction - Distance de rétraction 7-12

# @model
source: Retract Tower - Retract Speed 10-50
fr_fr: Tour de rétraction - Vitesse de rétraction 10-50

# @model
source: Retract Tower - Retract Speed 35-75
fr_fr: Tour de rétraction - Vitesse de rétraction 35-75

# @model
source: Retract Tower - Retract Speed 60-100
fr_fr: Tour de rétraction - Vitesse de rétraction 60-100

# @type
source: Speed
fr_fr: Vitesse

# @model
source: Bed Size 220x220
fr_fr: Plateau 220x220

# @model
source: Bed Size 200x200
fr_fr: Plateau 200x200

# @model
source: Bed Size 180x180
fr_fr: Plateau 180x180

# @model
source: Bed Size 150x150
fr_fr: Plateau 150x150

# @pattern
source: Spiral Squares
fr_fr: Carrés en spirale

# @pattern
source: Concentric Squares
fr_fr: Carrés concentriques

# @pattern
source: Concentric Circles
fr_fr: Cercles concentriques

# @pattern
source: X in Square
fr_fr: X dans Carré

# @pattern
source: Circle in Square
fr_fr: Cercle dans carré

# @pattern
source: Grid
fr_fr: Grille

# @pattern
source: Padded Grid
fr_fr: Grille et pastille

# @pattern
source: Five Circles
fr_fr: Cinq cercles

# @model
source: Fan Tower - 0-100%
fr_fr: Tour de ventilateur - 0-100%

# @title
source: Temperature Tower
fr_fr: Tour de Température

# @label
source: Preset
fr_fr: Réglages

# @label
source: Starting Temperature
fr_fr: Température départ

# @label
source: Ending Temperature
fr_fr: Température fin

# @label
source: Temperature Change
fr_fr: Température changement

# @label
source: Tower Label
fr_fr: Label Tour

# @label
source: Tower Description
fr_fr: Description Tour

# @button
source: Cancel
fr_fr: Annuler

# @title
source: Retraction Tower
fr_fr: Tour de rétraction

# @label
source: Retract Tower Preset
fr_fr: Tour de rétractation préréglée

# @model
source: Custom
fr_fr: Personnalisé

# @label
source: Tower Type
fr_fr: Type de tour

# @tooltip
source: The retraction chracteristic to change over the tower.<p>'Distance' changes the length of filament that is retracted or extruded.<p>'Speed' changes how quickly the filament is retracted or extruded.
fr_fr: La caractéristique de rétraction varie en fonction de la tour.<p>La "Distance" modifie la longueur du filament qui est rétracté ou extrudé.<p>La "vitesse" modifie la vitesse à laquelle le filament est rétracté ou extrudé.

# @label
source: Starting
fr_fr: Début

# @tooltip
source: The retraction value (speed or distance) for the first section of the tower.<p>For 'Distance' towers, this is the length of filament retracted or extruded for each section.<p>For 'Speed' towers, this is the speed at which the filament is retracted or extruded.
fr_fr: La valeur de rétraction (vitesse ou distance) pour la première section de la tour.<p>Pour les tours "Distance", il s'agit de la longueur de filament rétractée ou extrudée pour chaque section.<p>Pour les tours 'Vitesse', il s'agit de la vitesse à laquelle le filament est rétracté ou extrudé.

# @label
source: Ending
fr_fr: Fin

# @tooltip
source: The retraction value (speed or distance) for the last section of the tower.<p>For 'Distance' towers, this is the length of filament retracted or extruded for each section.<p>For 'Speed' towers, this is the speed at which the filament is retracted or extruded.
fr_fr: La valeur de rétraction (vitesse ou distance) pour la dernière section de la tour.<p>Pour les tours "Distance", il s'agit de la longueur de filament rétractée ou extrudée pour chaque section.<p>Pour les tours "Vitesse", il s'agit de la vitesse à laquelle le filament est rétracté ou extrudé.

# @label
source: Change
fr_fr: Changement

# @tooltip
source: The amount to change the retraction value (speed or distance) between tower sections.<p>In combination with the starting and ending values, this determines the number of sections in the tower.
fr_fr: Montant permettant de modifier la valeur de rétraction (vitesse ou distance) entre les sections de l'échafaudage.<p>En combinaison avec les valeurs de départ et d'arrivée, cela détermine le nombre de sections dans l'échafaudage.

# @label
source: An optional label to carve up the left side of the tower.<p>This can be used, for example, to identify the purpose of the tower or the material being printed.
fr_fr: Une étiquette facultative à graver sur le côté gauche de la tour.<p>Elle peut être utilisée, par exemple, pour identifier l'objet de la tour ou le matériau à imprimer.

# @title
source: Bed Level Pattern
fr_fr: Test Mise à niveau plateau

# @label
source: Pattern
fr_fr: Motif

# @tooltip
source: The type of bed level Pattern to generate.<p>Each pattern covers different parts of the bed in different ways and some are faster than others.<p>The icon on the left side of this dialog will give an idea of what the bed level Pattern type will look like.
fr_fr: Le type de motif de mise à niveau de plateau à générer.<p>Chaque motif couvre différentes parties du plateau de différentes manières et certains sont plus rapides que d'autres.<p>L'icône à gauche de cette boîte de dialogue donne une idée de ce à quoi ressemblera le type de motif au niveau du plateau.

# @label
source: Bed Fill %
fr_fr: Remplissage plateau %

# @tooltip
source: This controls how much of the printer area the pattern should take up.<p>A value of 100 will result in the entire print area being used and may not work.<p>Values below 75 are probably not useful.<p>90 is a good default.
fr_fr: Cette valeur permet de contrôler l'étendue de la zone d'impression que le motif doit occuper.<p>Une valeur de 100 entraînera l'utilisation de la totalité de la zone d'impression et risque de ne pas fonctionner.<p>Les valeurs inférieures à 75 ne sont probablement pas utiles.<p>90 est une bonne valeur par défaut.

# @label
source: Number of Rings
fr_fr: Nombre d'anneaux

# @tooltip
source: The number of concentric rings to generate in the pattern.
fr_fr: Le nombre d'anneaux concentriques à générer dans le motif.

# @label
source: Size in Cells
fr_fr: Nombre de cellules

# @tooltip
source: The size of the grid in cells.
fr_fr: Nombre de cellules définissant la grille.

# @label
source: Pad Size
fr_fr: Nb des cellules

# @tooltip
source: The size of each of the pads in the pattern.
fr_fr: La taille de chacun des carré du modèle.

# @title
source: Fan Tower
fr_fr: Tour de ventilateur

# @label
source: Fan Tower Preset
fr_fr: Tour de ventilateur Préréglage

# @label
source: Starting Fan Speed %
fr_fr: Vitesse de démarrage du ventilateur %

# @tooltip
source: The fan speed % for the first section of the tower.<p>This value will be changed for each section of the tower.<p>This should be a value between 0 and 100.
fr_fr: La vitesse du ventilateur en % pour la première section de la tour.<p>Cette valeur sera modifiée pour chaque section de la tour.<p>Cette valeur doit être comprise entre 0 et 100.

# @label
source: Ending Fan Speed %
fr_fr: Vitesse de fin du ventilateur %

# @tooltip
source: The fan speed % for the last section of the tower.<p>This should be a value between 0 and 100.
fr_fr: La vitesse du ventilateur en % pour la dernière section de la tour.<p>Cette valeur doit être comprise entre 0 et 100.

# @label
source: Fan Speed % Change
fr_fr: Vitesse du ventilateur % de changement

# @tooltip
source: The amount to change the fan speed % between sections of the tower.<p>In combination with the start end end fan speed %, this determines the number of sections in the tower.
fr_fr: Montant permettant de modifier la vitesse du ventilateur en % entre les sections de l'échafaudage.<p>En combinaison avec le % de vitesse du ventilateur au début et à la fin, ceci détermine le nombre de sections dans la tour.

# @tooltip
source: An optional short label to carve into the base of the right column of the tower.<p>This must be four characters or less.
fr_fr: Une courte étiquette facultative à graver à la base de la colonne droite de la tour.<p>Elle ne doit pas dépasser quatre caractères.

# @tooltip
source: An optional label to carve up the left side of the tower.<p>This can be used, for example, to identify the purpose of the tower or the material being printed.
fr_fr: Une étiquette facultative à graver sur le côté gauche de la tour.<p>Elle peut être utilisée, par exemple, pour identifier l'objet de la tour ou le matériau à imprimer.

# @label
source: Maintain Value for Bridges
fr_fr: Maintenir la valeur pour les ponts

# @label
source: Selects whether the fan speed % for the current section is maintained while bridges are being printed.
fr_fr: Sélectionne si la vitesse du ventilateur % pour la section en cours est maintenue pendant l'impression des ponts.

# @title
source: Generating the Tower
fr_fr: Génération de la tour

# @label
source: Please wait while OpenSCAD generates the Auto Tower This may take a few minutes
fr_fr: Veuillez patienter pendant qu'OpenSCAD génère la Tour de test Cela peut prendre quelques minutes

# @title
source: Speed Tower
fr_fr: Tour de vitesse

# @tooltip
source: The type of speed to vary across the tower.<p>'Print Speed' towers change the speed at which the nozzle moves while printing (equivalent to Cura's 'print speed' setting).<p>'Acceleration' changes how fast the nozzle accelerates during printing.<p>The other towers are more specialized.
fr_fr: Le type de vitesse à faire varier dans la tour.<p>Les tours "Vitesse d'impression" modifient la vitesse à laquelle la buse se déplace pendant l'impression (équivalent au paramètre "vitesse d'impression" de Cura).<p>L'accélération modifie la vitesse à laquelle la buse accélère pendant l'impression.<p>Les autres tours sont plus spécialisées.

# @label
source: Starting Speed
fr_fr: Vitesse de début

# @tooltip
source: The speed value for the first section of the tower.
fr_fr: Valeur de la vitesse pour la première section de la tour.

# @label
source: Ending Speed
fr_fr: Vitesse de fin

# @tooltip
source: The speed value for the last section of the tower.
fr_fr: Valeur de la vitesse pour la dernière section de la tour.

# @label
source: Speed Change
fr_fr: Changement de vitesse

# @tooltip
source: The amount to change the speed between tower sections.<p>In combination with the starting and ending values, this determines the number of sections in the tower.
fr_fr: Montant permettant de modifier la vitesse entre les sections de la tour.<p>En combinaison avec les valeurs de départ et d'arrivée, cela détermine le nombre de sections dans la tour.

# @label
source: Wing Length
fr_fr: Longueur de l'aile

# @tooltip
source: The length of each 'wing' of the tower. Longer wings allow more time for the printer to get up to speed while printing, but results in more material being used.
fr_fr: La longueur de chaque "aile" de la tour. Des ailes plus longues permettent à l'imprimante d'avoir plus de temps pour atteindre sa vitesse d'impression, mais entraînent l'utilisation d'une plus grande quantité de matériau.

# @tooltip
source: An optional label to carve into the base of the tower.<p>This can be used, for example, to identify the purpose of the tower or the material being printed.
fr_fr: Une étiquette facultative à graver à la base de la tour.<p>Elle peut être utilisée, par exemple, pour identifier l'objet de la tour ou le matériau imprimé.

# @tooltip
source: An optional second description to carve into the base of the tower.<p>This is can be used to provide additional information about the tower - why you printed it, for instance.
fr_fr: Une deuxième description facultative à graver à la base de la tour.<p>Elle peut être utilisée pour fournir des informations supplémentaires sur la tour - pourquoi vous l'avez imprimée, par exemple.

# @label
source: Temp Tower Preset
fr_fr: Réglages Tour Température

# @tooltip
source: The nozzle temperature for the first section of the tower.<p>It is good practice to make this temperature higher than the ending temperature.
fr_fr: Température de la buse pour la première section de la tour.<p>Il est souhaitable que cette température soit plus élevée que la température finale.

# @tooltip
source: The nozzle temperature for the last section of the tower.<p>It is good practice to make this temperature lower than the starting temperature.
fr_fr: Température de la buse pour la dernière section de la tour.<p>Il est souhaitable que cette température soit inférieure à la température de départ.

# @tooltip
source: The amount to change the nozzle temperature between sections.<p>In combination with the starting and ending temperatures, this determines the number of sections in the tower.
fr_fr: Montant de la modification de la température de la buse entre les sections.\<p>En combinaison avec les températures de départ et d'arrivée, cela détermine le nombre de sections dans la tour.

# @title
source: Settings
fr_fr: Réglages

# @label
source: OpenSCAD path
fr_fr: Chemin d'accès à OpenSCAD

# @tooltip
source: The path to the OpenSCAD executable.<p>If it is in the current path or installed in an expected location, the plugin should find it automatically.<p>You can manually set or override the path here.<p>Clearing out this value will cause the plugin to attempt to automatically locate OpenSCAD again.
fr_fr: Le chemin d'accès à l'exécutable OpenSCAD.<p>S'il se trouve dans le chemin actuel ou s'il est installé à un emplacement prévu, le plugin devrait le trouver automatiquement.<p>Vous pouvez définir manuellement ou remplacer le chemin ici.<p>En supprimant cette valeur, le plugin tentera à nouveau de localiser automatiquement OpenSCAD.

# @label
source: Correct print settings
fr_fr: Paramètres d'impression corrects

# @tooltip
source: When checked, the plugin will automatically correct print settings for best results when printing the selected tower.
fr_fr: Si cette option est cochée, le plugin corrigera automatiquement les paramètres d'impression pour obtenir les meilleurs résultats lors de l'impression de la tour sélectionnée.

# @label
source: Enable LCD messages
fr_fr: Activer les messages sur l'écran LCD

# @tooltip
source: Selects whether tower parameter changes (temperature, speed, etc) are displayed to your printer's LCD.<p>Information is displayed using the M117 command, which can cause issues with some printers (The Dremel 3D45, for instance)<p>Deselect this if you are noticing issues.
fr_fr: Sélectionne si les changements de paramètres de la tour (température, vitesse, etc.) sont affichés sur l'écran LCD de votre imprimante.<p>Les informations sont affichées à l'aide de la commande M117, ce qui peut poser des problèmes avec certaines imprimantes (la Dremel 3D45, par exemple)<p>Désélectionnez cette option si vous constatez des problèmes.

# @label
source: Advanced GCode Comments
fr_fr: Commentaires avancés dans le GCode

# @tooltip
source: If enabled, this option allows more comments to be added to the modified GCode.<p>The use of more comments allows better control of the modifications made, but increases the size of the final code.
fr_fr: Si elle est activée, cette option permet d'ajouter plus de commentaires au code GC modifié. <p>L'utilisation de plus de commentaires permet un meilleur contrôle des modifications apportées, mais augmente la taille du code final.Si elle est activée, cette option permet d'ajouter plus de commentaires au Gcode modifié. <p>L'utilisation de plus de commentaires permet un meilleur contrôle des modifications apportées, mais augmente la taille du code final.

# @title
source: Flow Tower
fr_fr: Tour de débit

# @label
source: Tower Design
fr_fr: Conception de la tour

# @tootip
source: The tower model to use.<p>The 'Classic' model is the same tower that is used by the temperature tower.<p>The 'Spiral' model is radically different and may suit certain materials or uses better.<p>In the end, either one should work just fine.
fr_fr: Le modèle de tour à utiliser.<p>Le modèle 'Classique' est le même que celui utilisé par la tour de température.<p>Le modèle 'Spiral' est radicalement différent et peut mieux convenir à certains matériaux ou à certaines utilisations.<p>En fin de compte, l'un ou l'autre convient parfaitement.

# @label
source: Starting Flow %
fr_fr: Débit de départ %

# @tootip
source: The flow rate % for the first section of the tower.<p>This is equivalent to changing Cura's 'Flow' setting.<p>This value will be changed for each section of the tower<p>Rates less than 100 result in less filament being pushed through the nozzle.<p>Rates greater than 100 result in more filament being pushed through the nozzle.<p>It is good practice for the starting value to be higher than the ending value.
fr_fr: Le débit % pour la première section de la tour.<p>Cela équivaut à modifier le paramètre 'Flow' de Cura.<p>Cette valeur sera modifiée pour chaque section de la tour<p>Les taux inférieurs à 100 entraînent une diminution de la quantité de filament poussé à travers la buse.<p>Les taux supérieurs à 100 entraînent une plus grande quantité de filament à travers la buse.<p>Il est souhaitable que la valeur de départ soit supérieure à la valeur d'arrivée.

# @label
source: Ending Flow Rate %
fr_fr: Débit final %

# @tootip
source: The flow rate % for the last section of the tower.<p>This is equivalent to changing Cura's 'Flow' setting.<p>Rates less than 100 result in less filament being pushed through the nozzle.<p>Rates greater than 100 result in more filament being pushed through the nozzle.<p>It is good practice for the ending value to be lower than the starting value.
fr_fr: Le taux de débit % pour la dernière section de la tour.<p>Cela équivaut à modifier le paramètre 'Flow' de Cura.<p>Les taux inférieurs à 100 entraînent une diminution de la quantité de filament poussé à travers la buse.<p>Les taux supérieurs à 100 entraînent une plus grande quantité de filament à travers la buse.<p>Il est souhaitable que la valeur finale soit inférieure à la valeur initiale.

# @label
source: Flow Rate % Change
fr_fr: Débit % de variation

# @tootip
source: The amount to change the flow rate % between sections of the tower.<p>In combination with the start end end flow rates, this determines the number of sections in the tower.
fr_fr: An optional label to carve up the left side of the tower.<p>This can be used, for example, to identify the purpose of the tower or the material being printed.La quantité de variation du débit en % entre les sections de la tour.<p>En combinaison avec les débits de début et de fin, cela détermine le nombre de sections dans la tour.

# @tootip
source: An optional short label to carve into the base of the right column of the tower.<p>This must be four characters or less.
fr_fr: Une courte étiquette facultative à graver à la base de la colonne droite de la tour.<p>Une courte étiquette facultative à graver dans la base de la colonne droite de la tour.<p>Elle doit comporter quatre caractères ou moins.

# @tootip
source: An optional label to carve up the left side of the tower.<p>This can be used, for example, to identify the purpose of the tower or the material being printed.
fr_fr: Une étiquette facultative à graver sur le côté gauche de la tour.<p>Elle peut être utilisée, par exemple, pour identifier l'objet de la tour ou le matériau à imprimer.

# @text
source: Remove the AutoTower Model
fr_fr: Retirer le modèle AutoTower

# @msg
source: Found OpenScad version
fr_fr: Version d'OpenScad trouvée

# @msg
source: at
fr_fr: dans

# @msg
source: The OpenScad path
fr_fr: Le chemin OpenScad

# @msg
source: is not valid
fr_fr: n'est pas valide

# @msg
source: Changed
fr_fr: Modification

# @msg
source: Restored
fr_fr: Restauré

# @msg
source: to
fr_fr: en

# @msg
source: from
fr_fr: de

# @msg
source: The STL file
fr_fr: Le fichier STL

# @msg
source: does not exist
fr_fr: n'existe pas

# @msg
source: The Auto Tower was removed because the Cura setting
fr_fr: La tour auto a été supprimée parce que le paramètre Cura

# @msg
source: has changed since the tower was generated
fr_fr: a changé depuis la création de la tour

# @msg
source: Failed to generate
fr_fr: Échec de la génération

# @msg
source: Command output was
fr_fr: La sortie de la commande était

# @msg
source: An exception occured during post-processing
fr_fr: Une exception s'est produite pendant le post-traitement
